#include <iostream>

int main(){
    std::cout << "Ships battle" << std::endl;
    return 0;
}

// Задача 1. Корабли в “морском бое”

// Требуется объявить массивы для игры в морской бой и вывести
// их размеры в консоль, не используя констант с размерами. 
// Всего таких типов 4: крошечный, малый, средний и большой. 
// Для простоты, типом элементов корабля могут быть обычные
// bool (размер 1 байт).d